## 1. View First Few Rows

In [17]:
import pandas as pd
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

# Load the dataset
df = pd.read_csv('Bengaluru_House_Data.csv')

# Display first few rows
df.head()

pysqldf ("SELECT * FROM df LIMIT 20;")

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,None,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,None,1200,2.0,1.0,51.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00
6,Super built-up Area,18-May,Old Airport Road,4 BHK,Jaades,2732,4.0,NaN,204.00
7,Super built-up Area,Ready To Move,Rajaji Nagar,4 BHK,Brway G,3300,4.0,NaN,600.00
8,Super built-up Area,Ready To Move,Marathahalli,3 BHK,None,1310,3.0,1.0,63.25
9,Plot Area,Ready To Move,Gandhi Bazar,6 Bedroom,None,1020,6.0,NaN,370.00
10,Super built-up Area,18-Feb,Whitefield,3 BHK,None,1800,2.0,2.0,70.00
11,Plot Area,Ready To Move,Whitefield,4 Bedroom,Prrry M,2785,5.0,3.0,295.00
12,Super built-up Area,Ready To Move,7th Phase JP Nagar,2 BHK,Shncyes,1000,2.0,1.0,38.00
13,Built-up Area,Ready To Move,Gottigere,2 BHK,None,1100,2.0,2.0,40.00
14,Plot Area,Ready To Move,Sarjapur,3 Bedroom,Skityer,2250,3.0,2.0,148.00
15,Super built-up Area,Ready To Move,Mysore Road,2 BHK,PrntaEn,1175,2.0,2.0,73.50
16,Super built-up Area,Ready To Move,Bisuvanahalli,3 BHK,Prityel,1180,3.0,2.0,48.00
17,Super built-up Area,Ready To Move,Raja Rajeshwari Nagar,3 BHK,GrrvaGr,1540,3.0,3.0,60.00
18,Super built-up Area,Ready To Move,Ramakrishnappa Layout,3 BHK,PeBayle,2770,4.0,2.0,290.00
19,Super built-up Area,Ready To Move,Manayata Tech Park,2 BHK,None,1100,2.0,2.0,48.00

## 2. Basic Info

In [2]:
#-- 2.1 Count Total Rows
pysqldf ("""SELECT COUNT(*) AS total_records FROM df;""")

   total_records
0          13320

In [3]:
#-- 2.2 Count Non-Nulls (null count workaround)
pysqldf ("""SELECT 
  COUNT(area_type) AS non_null_area_type,
  COUNT(availability) AS non_null_availability,
  COUNT(location) AS non_null_location,
  COUNT(size) AS non_null_size,
  COUNT(society) AS non_null_society,
  COUNT(total_sqft) AS non_null_total_sqft,
  COUNT(bath) AS non_null_bath,
  COUNT(balcony) AS non_null_balcony,
  COUNT(price) AS non_null_price
FROM df;""")

,non_null_area_type,non_null_availability,non_null_location,non_null_size,non_null_society,non_null_total_sqft,non_null_bath,non_null_balcony,non_null_price
0,13320,13320,13319,13304,7818,13320,13247,12711,13320

## 3. Distribution by Area Type

In [4]:
pysqldf ("""SELECT area_type, COUNT(*) AS total FROM df GROUP BY area_type ORDER BY total DESC;""")

              area_type  total
0  Super built-up  Area   8790
1        Built-up  Area   2418
2            Plot  Area   2025
3          Carpet  Area     87

## 4. Most Frequent Locations

In [5]:
pysqldf ("""SELECT location, COUNT(*) AS num_properties FROM df GROUP BY location ORDER BY num_properties DESC LIMIT 10;""")

                location  num_properties
0             Whitefield             540
1         Sarjapur  Road             399
2        Electronic City             302
3         Kanakpura Road             273
4            Thanisandra             234
5              Yelahanka             213
6            Uttarahalli             186
7                 Hebbal             177
8           Marathahalli             175
9  Raja Rajeshwari Nagar             171

## 5. Most Common Property Sizes

In [6]:
pysqldf ("""SELECT size, COUNT(*) AS count FROM df GROUP BY size ORDER BY count DESC LIMIT 10;""")

        size  count
0      2 BHK   5199
1      3 BHK   4310
2  4 Bedroom    826
3      4 BHK    591
4  3 Bedroom    547
5      1 BHK    538
6  2 Bedroom    329
7  5 Bedroom    297
8  6 Bedroom    191
9  1 Bedroom    105

## 6. Count of Properties by BHK

In [7]:
pysqldf ("""SELECT 
  CAST(SUBSTR(size, 1, INSTR(size, ' ') - 1) AS INTEGER) AS bhk,
  COUNT(*) AS total
FROM df
WHERE size LIKE '%BHK%' OR size LIKE '%Bedroom%'
GROUP BY bhk
ORDER BY bhk;""")

    bhk  total
0     1    643
1     2   5528
2     3   4857
3     4   1417
4     5    356
5     6    221
6     7    100
7     8     89
8     9     54
9    10     14
10   11      4
11   12      1
12   13      1
13   14      1
14   16      1
15   18      1
16   19      1
17   27      1
18   43      1

## 7. Average Price per BHK

In [8]:
pysqldf ("""SELECT 
  CAST(SUBSTR(size, 1, INSTR(size, ' ') - 1) AS INTEGER) AS bhk,
  AVG(price) AS avg_price
FROM df
WHERE size LIKE '%BHK%' OR size LIKE '%Bedroom%'
GROUP BY bhk
ORDER BY bhk;""")

    bhk   avg_price
0     1   44.967232
1     2   59.579211
2     3  110.952326
3     4  270.634474
4     5  281.549157
5     6  223.927602
6     7  244.370000
7     8  207.550562
8     9  241.944444
9    10  530.000000
10   11  207.500000
11   12  300.000000
12   13  275.000000
13   14  125.000000
14   16  550.000000
15   18  200.000000
16   19  490.000000
17   27  230.000000
18   43  660.000000

## 8. Price per Area Type

In [9]:
pysqldf ("""SELECT area_type, AVG(price) AS avg_price, COUNT(*) AS count FROM df GROUP BY area_type ORDER BY avg_price DESC;""")

              area_type   avg_price  count
0            Plot  Area  208.495486   2025
1        Built-up  Area  104.285498   2418
2  Super built-up  Area   92.971757   8790
3          Carpet  Area   89.502356     87

## 9. Price Distribution by Bathroom Count

In [10]:
pysqldf ("""SELECT bath, COUNT(*) AS count, AVG(price) AS avg_price FROM df GROUP BY bath ORDER BY bath;""")

    bath  count    avg_price
0    NaN     73   144.907671
1    1.0    788    47.584632
2    2.0   6908    63.404087
3    3.0   3286   125.131888
4    4.0   1226   237.005812
5    5.0    524   309.363073
6    6.0    273   283.223443
7    7.0    102   300.352941
8    8.0     64   268.640625
9    9.0     43   281.069767
10  10.0     13   217.307692
11  11.0      3   188.333333
12  12.0      7   291.428571
13  13.0      3  1341.666667
14  14.0      1   500.000000
15  15.0      1   125.000000
16  16.0      2   520.000000
17  18.0      1   200.000000
18  27.0      1   230.000000
19  40.0      1   660.000000

## 10. Location-wise Average Price (only locations with >10 properties)

In [11]:
pysqldf ("""SELECT location, COUNT(*) AS count, AVG(price) AS avg_price
FROM df
GROUP BY location
HAVING COUNT(*) > 10
ORDER BY avg_price DESC
LIMIT 10;""")

             location  count   avg_price
0     Cunningham Road     13  824.384615
1           Kodihalli     15  367.733333
2        Malleshwaram     58  358.263793
3         Benson Town     15  346.743333
4       HAL 2nd Stage     11  339.272727
5        Rajaji Nagar    107  327.693084
6        Bommenahalli     13  312.692308
7  Mahalakshmi Layout     13  294.846154
8        Indira Nagar     44  286.318182
9          Giri Nagar     14  273.142857

## 11. Price Trends for 2BHK vs 3BHK

In [12]:
pysqldf ("""SELECT 
  location,
  AVG(CASE 
      WHEN CAST(SUBSTR(size, 1, INSTR(size, ' ') - 1) AS INTEGER) = 2 THEN price
      ELSE NULL END) AS avg_2bhk_price,
  AVG(CASE 
      WHEN CAST(SUBSTR(size, 1, INSTR(size, ' ') - 1) AS INTEGER) = 3 THEN price
      ELSE NULL END) AS avg_3bhk_price
FROM df
GROUP BY location
HAVING COUNT(*) > 10
ORDER BY avg_2bhk_price DESC
LIMIT 10;""")

        location  avg_2bhk_price  avg_3bhk_price
0    Benson Town      186.000000      286.000000
1   Rajaji Nagar      155.339259      283.954545
2  HAL 2nd Stage      140.000000      294.250000
3     Cooke Town      133.666667      238.777778
4   Indira Nagar      124.000000      210.466667
5         Domlur      119.250000      166.500000
6    Koramangala      116.966071      174.151515
7    Basavangudi      110.000000      192.470588
8    Frazer Town      109.666667      228.550000
9       Cox Town      108.500000      135.000000

## 12. Price Range per BHK Type

In [13]:
pysqldf ("""SELECT 
  CAST(SUBSTR(size, 1, INSTR(size, ' ') - 1) AS INTEGER) AS bhk,
  MIN(price) AS min_price,
  MAX(price) AS max_price,
  AVG(price) AS avg_price
FROM df
WHERE size LIKE '%BHK%' OR size LIKE '%Bedroom%'
GROUP BY bhk
ORDER BY bhk;""")

    bhk  min_price  max_price   avg_price
0     1        8.0      750.0   44.967232
1     2       10.5      650.0   59.579211
2     3       10.0     2000.0  110.952326
3     4       24.5     2912.0  270.634474
4     5       44.5     2736.0  281.549157
5     6       58.0     2800.0  223.927602
6     7       52.0     2200.0  244.370000
7     8       50.0     1900.0  207.550562
8     9       75.0     1200.0  241.944444
9    10       90.0     3600.0  530.000000
10   11      150.0      360.0  207.500000
11   12      300.0      300.0  300.000000
12   13      275.0      275.0  275.000000
13   14      125.0      125.0  125.000000
14   16      550.0      550.0  550.000000
15   18      200.0      200.0  200.000000
16   19      490.0      490.0  490.000000
17   27      230.0      230.0  230.000000
18   43      660.0      660.0  660.000000

## 13. Locations with Cheapest Average Price

In [14]:
pysqldf ("""SELECT location, COUNT(*) AS count, AVG(price) AS avg_price
FROM df
GROUP BY location
HAVING count > 5
ORDER BY avg_price ASC
LIMIT 10;""")

                      location  count  avg_price
0                 Ananth Nagar     30  33.713000
1                   Chandapura    100  34.015550
2             Kereguddadahalli     16  35.818750
3                       Anekal     36  37.958333
4                  Kammasandra     29  38.054483
5           Volagerekallahalli      9  39.506667
6                 Gunjur Palya     10  39.806000
7                       Huskur      8  39.877500
8  Bommasandra Industrial Area     26  40.949615
9                  Dommasandra     13  41.028462

## 14. Average Square Foot per BHK

In [15]:
pysqldf ("""SELECT 
  CAST(SUBSTR(size, 1, INSTR(size, ' ') - 1) AS INTEGER) AS bhk,
  AVG(CAST(total_sqft AS FLOAT)) AS avg_sqft
FROM df
WHERE total_sqft NOT LIKE '%-%' AND total_sqft NOT LIKE '%Sq. Meter%'
GROUP BY bhk
ORDER BY bhk;""")

     bhk      avg_sqft
0    NaN   2200.250000
1    1.0    748.026765
2    2.0   1136.914247
3    3.0   1675.855077
4    4.0   2685.804078
5    5.0   2369.193989
6    6.0   2035.226109
7    7.0   2309.750000
8    8.0   1917.314607
9    9.0   2951.132075
10  10.0   3411.142857
11  11.0   3350.000000
12  12.0   2232.000000
13  13.0   5425.000000
14  14.0   1250.000000
15  16.0  10000.000000
16  18.0   1200.000000
17  19.0   2000.000000
18  27.0   8000.000000
19  43.0   2400.000000

## 15. Listings by Price Range Bucket

In [16]:
pysqldf ("""SELECT 
  CASE 
    WHEN price < 50 THEN '<50L'
    WHEN price BETWEEN 50 AND 100 THEN '50L1Cr'
    WHEN price BETWEEN 100 AND 200 THEN '1Cr2Cr'
    ELSE '>2Cr'
  END AS price_range,
  COUNT(*) AS count
FROM df
GROUP BY price_range
ORDER BY count DESC;""")

  price_range  count
0     50L1Cr   5938
1        <50L   3279
2     1Cr2Cr   2629
3        >2Cr   1474